<?php
function random_str () {
$quotes="人生的价值，并不是用时间，而是用深度去衡量的。－－ 列夫·托尔斯泰
三人行，必有我师焉。择其善者而从之，其不善者而改之。——孔子
人生不是一种享乐，而是一桩十分沉重的工作。－－ 列夫·托尔斯泰
成为卓越的代名词，很多人并不需要杰出素质的环境。——Steve Jobs
活着就是为了改变世界，难道还有其他原因吗？——Steve Jobs
Follow yourself.追随你的内心。——Steve Jobs
青年时种下什么，老年时就收获什么。—— 易卜生
“火箭惯性平台随动环回路中电子器件的焊接质量问题” —— 长三乙火箭首次发射失败原因
人并不是因为美丽才可爱，而是因为可爱才美丽。—— 托尔斯泰
人的美德的荣誉比他的财富的荣誉不知大多少倍。—— 达·芬奇
人的生命是有限的，可是，为人民服务是无限的，我要把有限的生命，投入到无限的为人民服务之中去。—— 雷锋
人的天职在勇于探索真理。—— 哥白尼
人的知识愈广，人的本身也愈臻完善。—— 高尔基
人的智慧掌握着三把钥匙，一把开启数字，一把开启字母，一把开启音符。知识、思想、幻想就在其中。—— 雨果
人们常觉得准备的阶段是在浪费时间，只有当真正机会来临，而自己没有能力把握的时候，才能觉悟自己平时没有准备才是浪费了时间。—— 罗曼.罗兰
人生不是一种享乐，而是一桩十分沉重的工作。—— 列夫·托尔斯泰
人生应该如蜡烛一样，从顶燃到底，一直都是光明的。—— 萧楚女
人需要真理，就像瞎子需要明快的引路人一样。—— 高尔基
任何问题都有解决的办法，无法可想的事是没有的。—— 爱迪生
如果你希望成功，当以恒心为良友，以经验为参谋，以当心为兄弟，以希望为哨兵。—— 爱迪生
如果是玫瑰，它总会开花的。—— 歌德
如果我比笛卡尔看得远些，那是因为我站在巨人们的肩上的缘故。—— 牛顿
善于利用零星时间的人，才会做出更大的成绩来。—— 华罗庚
少而好学，如日出之阳；壮而好学，如日中之光；老而好学，如炳烛之明。—— 刘向
生活得最有意义的人，并不就是年岁活得最大的人，而是对生活最有感受的人—— 卢梭
生活的理想，就是为了理想的生活。—— 张闻天
生活的情况越艰难，我越感到自己更坚强，甚而也更聪明。—— 高尔基
生活的全部意义在于无穷地探索尚未知道的东西，在于不断地增加更多的知识。—— 左拉
生活最沉重的负担不是工作，而是无聊。—— 罗曼·罗兰
生命的意义在于付出，在于给予，而不是在于接受，也不是在于争取。—— 巴金
生命多少用时间计算，生命的价值用贡献计算。—— 裴多菲
时间，就象海棉里的水，只要愿挤，总还是有的。—— 鲁迅
时间是伟大的作者，她能写出未来的结局。—— 卓别林
时间最不偏私，给任何人都是二十四小时；时间也最偏私，给任何人都不是二十四小时。—— 赫胥黎
世界上最快而又最慢，最长而又最短，最平凡而又最珍贵，最易被忽视而又最令人后悔的就是时间。—— 高尔基
世有伯乐，然后有千里马。—— 韩愈
人生应该如蜡烛一样，从顶燃到底，一直都是光明的。 —— 萧楚女
人生的价值，即以其人对于当代所做的工作为尺度。 —— 徐玮
路是脚踏出来的，历史是人写出来的。人的每一步行动都在书写自己的历史。 —— 吉鸿昌
春蚕到死丝方尽，人至期颐亦不休。一息尚存须努力，留作青年好范畴。 —— 吴玉章
但愿每次回忆，对生活都不感到负疚 —— 郭小川
人的一生可能燃烧也可能腐朽，我不能腐朽，我愿意燃烧起来！ —— 奥斯特洛夫斯基
你若要喜爱你自己的价值，你就得给世界创造价值。 —— 歌德
社会犹如一条船，每个人都要有掌舵的准备。 —— 易卜生
人生不是一种享乐，而是一桩十分沉重的工作。 —— 列夫·托尔斯泰
人生的价值，并不是用时间，而是用深度去衡量的。 —— 列夫·托尔斯泰
生活只有在平淡无味的人看来才是空虚而平淡无味的。 —— 车尔尼雪夫斯基
一个人的价值，应该看他贡献什么，而不应当看他取得什么。 —— 爱因斯坦
人只有献身于社会，才能找出那短暂而有风险的生命的意义。 —— 爱因斯坦
芸芸众生，孰不爱生？爱生之极，进而爱群。 —— 秋瑾
生活真象这杯浓酒，不经三番五次的提炼呵，就不会这样可口！ —— 郭小川
充满着欢乐与斗争精神的人们，永远带着欢乐，欢迎雷霆与阳光。 —— 赫胥黎
生活就是战斗。 —— 柯罗连科
为了生活中努力发挥自己的作用，热爱人生吧。 —— 罗丹
希望是附丽于存在的，有存在，便有希望，有希望，便是光明。 —— 鲁迅
沉沉的黑夜都是白天的前奏。 —— 郭小川
当一个人用工作去迎接光明，光明很快就会来照耀着他。 —— 冯学峰
东天已经到来，春天还会远吗？ —— 雪莱
过去属于死神，未来属于你自己。 —— 雪莱
世间的活动，缺点虽多，但仍是美好的。 —— 罗丹
辛勤的蜜蜂永没有时间悲哀。 —— 布莱克
希望是厄运的忠实的姐妹。 —— 普希金
当你的希望一个个落空，你也要坚定，要沉着！ —— 朗费罗
先相信你自己，然后别人才会相信你。 —— 屠格涅夫
宿命论是那些缺乏意志力的弱者的借口。 —— 罗曼·罗兰
我们唯一不会改正的缺点是软弱。 —— 拉罗什福科
私心胜者，可以灭公。 —— 林逋
人人好公，则天下太平；人人营私，则天下大乱。 —— 刘鹗
自私自利之心，是立人达人之障。 —— 吕坤
如烟往事俱忘却，心底无私天地宽。 —— 陶铸
常求有利别人，不求有利自己。 —— 谢觉哉
一切利己的生活，都是非理性的，动物的生活。 —— 列夫·托尔斯泰
人的理性粉碎了迷信，而人的感情也将摧毁利己主义。 —— 海涅
无私是稀有的道德，因为从它身上是无利可图的。 —— 布莱希特
君子喻于义，小人喻于利。 —— 孔丘
不戚戚于贫贱，不汲汲于富贵。 —— 陶渊明
富贵不淫贫贱乐，男儿到此是豪雄。 —— 程颢
清贫，洁白朴素的生活，正是我们革命者能够战胜许多困难的地方！ —— 方志敏
三军可夺帅也,匹夫不可夺志也。 —— 孔丘
志不强者智不达。 —— 墨翟
燕雀安知鸿鹄之志哉！ —— 陈涉
志当存高远。 —— 诸葛亮
老骥伏枥，志在千里；烈士暮年，壮心不已。 —— 曹操
燕雀戏藩柴，安识鸿鹄游。 —— 曹植
穷且益坚，不坠青云之志。 —— 王勃
大鹏一日同风起，扶摇直上九万里。 —— 李白
古之立大事者，不惟有超世之才，亦必有坚忍不拔之志。 —— 苏轼
生当作人杰，死亦为鬼雄，至今思项羽，不肯过江东。 —— 李清照
壮心未与年俱老，死去犹能作鬼雄。 —— 陆游
故立志者，为学之心也；为学者，立志之事也。 —— 王阳明
贫不足羞，可羞是贫而无志。 —— 吕坤
我们以人们的目的来判断人的活动。目的伟大，活动才可以说是伟大的。 —— 契诃夫
毫无理想而又优柔寡断是一种可悲的心理。 —— 培根
生活的理想，就是为了理想的生活。 —— 张闻天
人，只要有一种信念，有所追求，什么艰苦都能忍受，什么环境也都能适应。 —— 丁玲
理想的人物不仅要在物质需要的满足上，还要在精神旨趣的满足上得到表现。 —— 黑格尔
一个能思想的人，才真是一个力量无边的人。 —— 巴尔扎克
生活是不公平的；要去适应它。——比尔盖茨
常常提醒自己注意幸福，就像在寒冷的日子里经常看看太阳，心就不知不觉暖洋洋，亮光光。——毕淑敏
幸福是一种心灵的振颤。它像会倾听音乐的耳朵一样，需要不断地训练。——毕淑敏
这世界并不会在意你的自尊。这世界指望你在自我感觉良好之前先要有所成就。——比尔盖茨
生活只有在平淡无味的人看来才是空虚而平淡无味的。－－ 车尔尼雪夫斯基";
$quotes=explode("\n",$quotes);
return $quotes[rand(0,count($quotes)-1)];
}

function quotes(){
$quotes=random_str();
echo $quotes;
}
?>